share/tutorials/heat-transfer/buoyant-boussinesq-pimple/hot_room/0.org/p_rgh
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p_rgh;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  floor
  {
    type            fixedFluxPressure;
    rho             rhok;
    value           uniform 0;
  }
  ceiling
  {
    type            fixedFluxPressure;
    rho             rhok;
    value           uniform 0;
  }
  fixedWalls
  {
    type            fixedFluxPressure;
    rho             rhok;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
