share/tutorials/heat-transfer/buoyant-boussinesq-pimple/hot_room/system/setFieldsDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      setFieldsDict;
}

defaultFieldValues
(
  volScalarFieldValue T 300
);
regions
(
  // Set patch values (using ==)
  boxToFace
  {
    box (4.5 -1000 4.5) (5.5 1e-5 5.5);
    fieldValues
    (
      volScalarFieldValue T 600
    );
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
